owhinata/spike-nx/boards/spike-prime-hub/src/stm32_w25q256.c
/****************************************************************************
 * boards/spike-prime-hub/src/stm32_w25q256.c
 *
 * Winbond W25Q256 32 MB SPI NOR flash driver for SPIKE Prime Hub.
 *
 * Hardware:
 *   SPI2: SCK=PB13, MISO=PC2, MOSI=PC3 (AF5)
 *   /CS:  PB12 (software NSS, idle HIGH)
 *   DMA:  DMA1 Stream3 Ch0 (RX), DMA1 Stream4 Ch0 (TX)
 *
 * The W25Q256 is 32 MB and requires 4-byte addressing.  This driver always
 * uses dedicated 4-byte commands (Fast Read 0x0C, Page Program 0x12,
 * Sector Erase 0x21) so it does not depend on the device's address-mode
 * register state across resets (matches pybricks driver behavior).
 *
 * Partition layout:
 *   0x000000-0x0FFFFF  (1 MB)   reserved (LEGO bootloader area)
 *   0x100000-0x1FFFFFF (31 MB)  exposed as /dev/mtdblock0 → LittleFS
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/signal.h>
#include <nuttx/fs/fs.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/spi/spi.h>
#include <nuttx/mtd/mtd.h>

#include <arch/board/board.h>

#include "stm32.h"
#include "stm32_spi.h"
#include "spike_prime_hub.h"

#ifdef CONFIG_STM32_SPI2

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SPI configuration */

#define W25Q256_SPI_FREQUENCY  24000000   /* 24 MHz (APB1 48 MHz / 2) */
#define W25Q256_SPI_MODE       SPIDEV_MODE0
#define W25Q256_SPI_NBITS      8

/* W25Q256 instructions (4-byte addressing variants) */

#define W25Q256_CMD_WREN       0x06   /* Write Enable                       */
#define W25Q256_CMD_RDSR1      0x05   /* Read Status Register-1             */
#define W25Q256_CMD_RDSR2      0x35   /* Read Status Register-2             */
#define W25Q256_CMD_JEDEC_ID   0x9f   /* Read JEDEC ID                      */
#define W25Q256_CMD_FAST_READ4 0x0c   /* Fast Read with 4-byte address      */
#define W25Q256_CMD_PP4        0x12   /* Page Program with 4-byte address   */
#define W25Q256_CMD_SE4        0x21   /* Sector Erase 4 KB w/ 4-byte addr   */
#define W25Q256_CMD_BE4        0xdc   /* Block Erase 64 KB w/ 4-byte addr   */
#define W25Q256_CMD_CE         0xc7   /* Chip Erase                         */
#define W25Q256_CMD_RDP        0xab   /* Release Power Down                 */

/* Status register bits */

#define W25Q256_SR_BUSY        (1 << 0)
#define W25Q256_SR_WEL         (1 << 1)

/* JEDEC identification */

#define W25Q256_JEDEC_ID       0x00ef4019  /* MFR=Winbond, Type=0x40, Cap=0x19 */
#define W25Q256_JEDEC_MFR      0xef
#define W25Q256_JEDEC_TYPE     0x40
#define W25Q256_JEDEC_CAP      0x19

/* Geometry (chip-wide) */

#define W25Q256_PAGE_SIZE      256u
#define W25Q256_PAGE_SHIFT     8
#define W25Q256_SECTOR_SIZE    4096u                /* 4 KB */
#define W25Q256_SECTOR_SHIFT   12
#define W25Q256_BLOCK_SIZE     65536u               /* 64 KB */
#define W25Q256_BLOCK_SHIFT    16
#define W25Q256_CHIP_SIZE      (32u * 1024u * 1024u) /* 32 MB */
#define W25Q256_NSECTORS       (W25Q256_CHIP_SIZE / W25Q256_SECTOR_SIZE) /* 8192 */

#define W25Q256_ERASED_STATE   0xff

/* Mount layout */

#define W25Q256_RESERVED_BYTES 0x00100000u  /* 1 MB reserved (LEGO area) */
#define W25Q256_FS_START_SECTOR (W25Q256_RESERVED_BYTES / W25Q256_SECTOR_SIZE)
#define W25Q256_FS_NSECTORS     (W25Q256_NSECTORS - W25Q256_FS_START_SECTOR)

#define W25Q256_MTDBLOCK_PATH  "/dev/mtdblock0"
#define W25Q256_MOUNT_POINT    "/mnt/flash"
#define W25Q256_FS_TYPE        "littlefs"

/* Polling timeouts (microseconds).  Sector erase ~45 ms typ, 400 ms max.
 * Chip erase ~80 s max.  Use generous bounds.
 */

#define W25Q256_BUSY_POLL_USEC      50   /* per-iteration sleep        */
#define W25Q256_PROGRAM_TIMEOUT_US  100000   /* page program 100 ms    */
#define W25Q256_ERASE_TIMEOUT_US    1000000  /* sector erase 1 s       */
#define W25Q256_BULK_TIMEOUT_US     120000000 /* chip erase 120 s      */

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct w25q256_dev_s
{
  struct mtd_dev_s      mtd;     /* Must be first */
  FAR struct spi_dev_s *spi;     /* SPI bus instance */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* SPI helpers */

static void    w25q256_lock(FAR struct w25q256_dev_s *priv);
static void    w25q256_unlock(FAR struct w25q256_dev_s *priv);
static void    w25q256_send_addr4(FAR struct w25q256_dev_s *priv,
                                  uint32_t address);
static void    w25q256_write_enable(FAR struct w25q256_dev_s *priv);
static int     w25q256_wait_busy(FAR struct w25q256_dev_s *priv,
                                 uint32_t timeout_us);
static int     w25q256_read_jedec(FAR struct w25q256_dev_s *priv,
                                  FAR uint32_t *jedec);

/* Flash operations */

static int     w25q256_erase_sector(FAR struct w25q256_dev_s *priv,
                                    uint32_t address);
static int     w25q256_chip_erase(FAR struct w25q256_dev_s *priv);
static int     w25q256_program_page(FAR struct w25q256_dev_s *priv,
                                    uint32_t address,
                                    FAR const uint8_t *buffer,
                                    size_t nbytes);
static void    w25q256_read_data(FAR struct w25q256_dev_s *priv,
                                 uint32_t address,
                                 FAR uint8_t *buffer,
                                 size_t nbytes);

/* MTD interface */

