owhinata/spike-nx/boards/spike-prime-hub/src/stm32_w25q256.c
static int     w25q256_mtd_erase(FAR struct mtd_dev_s *dev,
                                 off_t startblock, size_t nblocks);
static ssize_t w25q256_mtd_bread(FAR struct mtd_dev_s *dev,
                                 off_t startblock, size_t nblocks,
                                 FAR uint8_t *buffer);
static ssize_t w25q256_mtd_bwrite(FAR struct mtd_dev_s *dev,
                                  off_t startblock, size_t nblocks,
                                  FAR const uint8_t *buffer);
static ssize_t w25q256_mtd_read(FAR struct mtd_dev_s *dev,
                                off_t offset, size_t nbytes,
                                FAR uint8_t *buffer);
static int     w25q256_mtd_ioctl(FAR struct mtd_dev_s *dev,
                                 int cmd, unsigned long arg);

/* Public board init helper (forward decl, declared in spike_prime_hub.h) */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: w25q256_lock
 *
 * Take exclusive access to the SPI bus and configure it for the W25Q256.
 * Required when the bus is shared (defensive — currently SPI2 has only one
 * device, but follow standard NuttX MTD driver convention).
 ****************************************************************************/

static void w25q256_lock(FAR struct w25q256_dev_s *priv)
{
  SPI_LOCK(priv->spi, true);
  SPI_SETMODE(priv->spi, W25Q256_SPI_MODE);
  SPI_SETBITS(priv->spi, W25Q256_SPI_NBITS);
  SPI_HWFEATURES(priv->spi, 0);
  SPI_SETFREQUENCY(priv->spi, W25Q256_SPI_FREQUENCY);
}

/****************************************************************************
 * Name: w25q256_unlock
 ****************************************************************************/

static void w25q256_unlock(FAR struct w25q256_dev_s *priv)
{
  SPI_LOCK(priv->spi, false);
}

/****************************************************************************
 * Name: w25q256_send_addr4
 *
 * Transmit a 4-byte address (MSB first) immediately after a command byte.
 ****************************************************************************/

static void w25q256_send_addr4(FAR struct w25q256_dev_s *priv,
                               uint32_t address)
{
  SPI_SEND(priv->spi, (address >> 24) & 0xff);
  SPI_SEND(priv->spi, (address >> 16) & 0xff);
  SPI_SEND(priv->spi, (address >>  8) & 0xff);
  SPI_SEND(priv->spi,  address        & 0xff);
}

/****************************************************************************
 * Name: w25q256_write_enable
 ****************************************************************************/

static void w25q256_write_enable(FAR struct w25q256_dev_s *priv)
{
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_WREN);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);
}

/****************************************************************************
 * Name: w25q256_wait_busy
 *
 * Poll Status Register-1 until BUSY clears or until timeout_us elapses.
 * Returns OK on success, -ETIMEDOUT on timeout.
 ****************************************************************************/

static int w25q256_wait_busy(FAR struct w25q256_dev_s *priv,
                             uint32_t timeout_us)
{
  uint32_t elapsed = 0;
  uint8_t  status;

  for (;;)
    {
      SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
      SPI_SEND(priv->spi, W25Q256_CMD_RDSR1);
      status = SPI_SEND(priv->spi, 0xff);
      SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);

      if ((status & W25Q256_SR_BUSY) == 0)
        {
          return OK;
        }

      if (elapsed >= timeout_us)
        {
          ferr("ERROR: W25Q256 BUSY timeout (status=0x%02x)\n", status);
          return -ETIMEDOUT;
        }

      nxsig_usleep(W25Q256_BUSY_POLL_USEC);
      elapsed += W25Q256_BUSY_POLL_USEC;
    }
}

/****************************************************************************
 * Name: w25q256_read_jedec
 ****************************************************************************/

static int w25q256_read_jedec(FAR struct w25q256_dev_s *priv,
                              FAR uint32_t *jedec)
{
  uint8_t mfr;
  uint8_t type;
  uint8_t cap;

  /* Make sure the device is awake (Release Power-Down).  No-op if already
   * powered up; harmless either way.
   */

  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_RDP);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);
  nxsig_usleep(50);

  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_JEDEC_ID);
  mfr  = SPI_SEND(priv->spi, 0xff);
  type = SPI_SEND(priv->spi, 0xff);
  cap  = SPI_SEND(priv->spi, 0xff);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);

  *jedec = ((uint32_t)mfr << 16) | ((uint32_t)type << 8) | cap;
  return OK;
}

/****************************************************************************
 * Name: w25q256_erase_sector
 ****************************************************************************/

static int w25q256_erase_sector(FAR struct w25q256_dev_s *priv,
                                uint32_t address)
{
  int ret;

  ret = w25q256_wait_busy(priv, W25Q256_ERASE_TIMEOUT_US);
  if (ret < 0)
    {
      return ret;
    }

  w25q256_write_enable(priv);

  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_SE4);
  w25q256_send_addr4(priv, address);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);

  return w25q256_wait_busy(priv, W25Q256_ERASE_TIMEOUT_US);
}

/****************************************************************************
 * Name: w25q256_chip_erase
 ****************************************************************************/

static int w25q256_chip_erase(FAR struct w25q256_dev_s *priv)
{
  int ret;

  ret = w25q256_wait_busy(priv, W25Q256_ERASE_TIMEOUT_US);
  if (ret < 0)
    {
      return ret;
    }

  w25q256_write_enable(priv);

  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_CE);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);

