owhinata/spike-nx/boards/spike-prime-hub/src/stm32_w25q256.c
  return w25q256_wait_busy(priv, W25Q256_BULK_TIMEOUT_US);
}

/****************************************************************************
 * Name: w25q256_program_page
 *
 * Program 1..256 bytes within a single page.  Caller must ensure that
 * (address & 0xff) + nbytes <= 256 so the program does not wrap.
 ****************************************************************************/

static int w25q256_program_page(FAR struct w25q256_dev_s *priv,
                                uint32_t address,
                                FAR const uint8_t *buffer,
                                size_t nbytes)
{
  int ret;

  DEBUGASSERT(nbytes > 0 && nbytes <= W25Q256_PAGE_SIZE);
  DEBUGASSERT(((address & (W25Q256_PAGE_SIZE - 1)) + nbytes)
              <= W25Q256_PAGE_SIZE);

  ret = w25q256_wait_busy(priv, W25Q256_PROGRAM_TIMEOUT_US);
  if (ret < 0)
    {
      return ret;
    }

  w25q256_write_enable(priv);

  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_PP4);
  w25q256_send_addr4(priv, address);
  SPI_SNDBLOCK(priv->spi, buffer, nbytes);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);

  return w25q256_wait_busy(priv, W25Q256_PROGRAM_TIMEOUT_US);
}

/****************************************************************************
 * Name: w25q256_read_data
 *
 * Issue Fast Read 4-byte (0x0C) and stream nbytes into buffer.  The Fast
 * Read command auto-increments the internal address counter and crosses
 * page/sector/block boundaries transparently.
 ****************************************************************************/

static void w25q256_read_data(FAR struct w25q256_dev_s *priv,
                              uint32_t address,
                              FAR uint8_t *buffer,
                              size_t nbytes)
{
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), true);
  SPI_SEND(priv->spi, W25Q256_CMD_FAST_READ4);
  w25q256_send_addr4(priv, address);
  SPI_SEND(priv->spi, 0xff);   /* dummy byte */
  SPI_RECVBLOCK(priv->spi, buffer, nbytes);
  SPI_SELECT(priv->spi, SPIDEV_FLASH(0), false);
}

/****************************************************************************
 * MTD methods
 ****************************************************************************/

/****************************************************************************
 * Name: w25q256_mtd_erase
 ****************************************************************************/

static int w25q256_mtd_erase(FAR struct mtd_dev_s *dev,
                             off_t startblock, size_t nblocks)
{
  FAR struct w25q256_dev_s *priv = (FAR struct w25q256_dev_s *)dev;
  size_t i;
  int    ret = OK;

  finfo("startblock=%jd nblocks=%zu\n", (intmax_t)startblock, nblocks);

  if ((size_t)startblock + nblocks > W25Q256_NSECTORS)
    {
      return -EINVAL;
    }

  w25q256_lock(priv);

  for (i = 0; i < nblocks; i++)
    {
      uint32_t addr = (uint32_t)(startblock + i) << W25Q256_SECTOR_SHIFT;

      ret = w25q256_erase_sector(priv, addr);
      if (ret < 0)
        {
          ferr("ERROR: erase_sector @0x%08" PRIx32 " failed: %d\n",
               addr, ret);
          break;
        }
    }

  w25q256_unlock(priv);

  return (ret < 0) ? ret : (int)nblocks;
}

/****************************************************************************
 * Name: w25q256_mtd_bread
 ****************************************************************************/

static ssize_t w25q256_mtd_bread(FAR struct mtd_dev_s *dev,
                                 off_t startblock, size_t nblocks,
                                 FAR uint8_t *buffer)
{
  FAR struct w25q256_dev_s *priv = (FAR struct w25q256_dev_s *)dev;
  uint32_t address;
  size_t   nbytes;

  /* Block size for bread/bwrite == page size (256 B) so that the MTD
   * partition layer aligns reads/writes on programmable page boundaries.
   * However LittleFS uses MTDIOC_GEOMETRY to learn the geometry and works
   * in those units, so we keep this consistent.
   */

  if ((size_t)startblock + nblocks
      > (W25Q256_CHIP_SIZE / W25Q256_PAGE_SIZE))
    {
      return -EINVAL;
    }

  address = (uint32_t)startblock << W25Q256_PAGE_SHIFT;
  nbytes  = nblocks << W25Q256_PAGE_SHIFT;

  w25q256_lock(priv);
  w25q256_read_data(priv, address, buffer, nbytes);
  w25q256_unlock(priv);

  return (ssize_t)nblocks;
}

/****************************************************************************
 * Name: w25q256_mtd_bwrite
 ****************************************************************************/

static ssize_t w25q256_mtd_bwrite(FAR struct mtd_dev_s *dev,
                                  off_t startblock, size_t nblocks,
                                  FAR const uint8_t *buffer)
{
  FAR struct w25q256_dev_s *priv = (FAR struct w25q256_dev_s *)dev;
  uint32_t address;
  size_t   i;
  int      ret = OK;

  if ((size_t)startblock + nblocks
      > (W25Q256_CHIP_SIZE / W25Q256_PAGE_SIZE))
    {
      return -EINVAL;
    }

  w25q256_lock(priv);

  for (i = 0; i < nblocks; i++)
    {
      address = (uint32_t)(startblock + i) << W25Q256_PAGE_SHIFT;

      ret = w25q256_program_page(priv, address,
                                 buffer + (i << W25Q256_PAGE_SHIFT),
                                 W25Q256_PAGE_SIZE);
      if (ret < 0)
        {
          ferr("ERROR: program_page @0x%08" PRIx32 " failed: %d\n",
               address, ret);
          break;
        }
    }

  w25q256_unlock(priv);

  return (ret < 0) ? ret : (ssize_t)nblocks;
}

/****************************************************************************
 * Name: w25q256_mtd_read
 ****************************************************************************/

static ssize_t w25q256_mtd_read(FAR struct mtd_dev_s *dev,
                                off_t offset, size_t nbytes,
                                FAR uint8_t *buffer)
{
  FAR struct w25q256_dev_s *priv = (FAR struct w25q256_dev_s *)dev;

  if ((uint64_t)offset + nbytes > W25Q256_CHIP_SIZE)
    {
      return -EINVAL;
    }

  w25q256_lock(priv);
  w25q256_read_data(priv, (uint32_t)offset, buffer, nbytes);
  w25q256_unlock(priv);

  return (ssize_t)nbytes;
}

/****************************************************************************
 * Name: w25q256_mtd_ioctl
 ****************************************************************************/

