owhinata/spike-nx/boards/spike-prime-hub/src/stm32_w25q256.c
static int w25q256_mtd_ioctl(FAR struct mtd_dev_s *dev,
                             int cmd, unsigned long arg)
{
  FAR struct w25q256_dev_s *priv = (FAR struct w25q256_dev_s *)dev;
  int ret = -ENOTTY;

  switch (cmd)
    {
      case MTDIOC_GEOMETRY:
        {
          FAR struct mtd_geometry_s *geo =
              (FAR struct mtd_geometry_s *)arg;

          if (geo == NULL)
            {
              ret = -EINVAL;
              break;
            }

          memset(geo, 0, sizeof(*geo));
          geo->blocksize    = W25Q256_PAGE_SIZE;     /* 256 B */
          geo->erasesize    = W25Q256_SECTOR_SIZE;   /* 4 KB  */
          geo->neraseblocks = W25Q256_NSECTORS;      /* 8192 (chip)  */
          strlcpy(geo->model, "W25Q256", sizeof(geo->model));

          ret = OK;
        }
        break;

      case BIOC_PARTINFO:
        {
          /* Reported when partitioning code or LittleFS asks.  Match the
           * NuttX upstream MTD convention: numsectors / sectorsize are in
           * R/W block (page) units, not erase-sector units.  See
           * nuttx/drivers/mtd/{w25,w25qxxxjv,gd25}.c.
           */

          FAR struct partition_info_s *info =
              (FAR struct partition_info_s *)arg;

          if (info == NULL)
            {
              ret = -EINVAL;
              break;
            }

          memset(info, 0, sizeof(*info));
          info->numsectors  = (W25Q256_CHIP_SIZE / W25Q256_PAGE_SIZE);
          info->sectorsize  = W25Q256_PAGE_SIZE;
          info->startsector = 0;
          strlcpy(info->parent, "", sizeof(info->parent));

          ret = OK;
        }
        break;

      case MTDIOC_ERASESECTORS:
        {
          FAR struct mtd_erase_s *erase =
              (FAR struct mtd_erase_s *)arg;

          if (erase == NULL)
            {
              ret = -EINVAL;
              break;
            }

          ret = w25q256_mtd_erase(dev, (off_t)erase->startblock,
                                       erase->nblocks);
          if (ret > 0)
            {
              /* MTDIOC_ERASESECTORS returns 0 on success */

              ret = OK;
            }
        }
        break;

      case MTDIOC_BULKERASE:
        {
          w25q256_lock(priv);
          ret = w25q256_chip_erase(priv);
          w25q256_unlock(priv);
        }
        break;

      case MTDIOC_ERASESTATE:
        {
          FAR uint8_t *result = (FAR uint8_t *)arg;

          if (result == NULL)
            {
              ret = -EINVAL;
              break;
            }

          *result = W25Q256_ERASED_STATE;
          ret = OK;
        }
        break;

      default:
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: w25q256_initialize
 *
 * Allocate and initialize a W25Q256 MTD device on the given SPI bus.
 * Verifies the JEDEC ID; returns NULL if the chip is not present or not
 * the expected W25Q256JV.
 ****************************************************************************/

static FAR struct mtd_dev_s *
w25q256_initialize(FAR struct spi_dev_s *spi)
{
  FAR struct w25q256_dev_s *priv;
  uint32_t jedec = 0;
  int      ret;

  priv = kmm_zalloc(sizeof(struct w25q256_dev_s));
  if (priv == NULL)
    {
      ferr("ERROR: kmm_zalloc failed\n");
      return NULL;
    }

  priv->spi = spi;

  priv->mtd.erase  = w25q256_mtd_erase;
  priv->mtd.bread  = w25q256_mtd_bread;
  priv->mtd.bwrite = w25q256_mtd_bwrite;
  priv->mtd.read   = w25q256_mtd_read;
  priv->mtd.ioctl  = w25q256_mtd_ioctl;
  priv->mtd.name   = "w25q256";

  /* Probe the chip */

  w25q256_lock(priv);
  ret = w25q256_read_jedec(priv, &jedec);
  w25q256_unlock(priv);

  if (ret < 0)
    {
      ferr("ERROR: JEDEC read failed: %d\n", ret);
      kmm_free(priv);
      return NULL;
    }

  if (jedec != W25Q256_JEDEC_ID)
    {
      ferr("ERROR: Unexpected JEDEC ID 0x%06" PRIx32
           " (expected 0x%06x)\n", jedec, W25Q256_JEDEC_ID);
      kmm_free(priv);
      return NULL;
    }

  syslog(LOG_INFO, "W25Q256: JEDEC ID 0x%06" PRIx32 ", 32MB detected\n",
         jedec);

  return &priv->mtd;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_spi2select / stm32_spi2status
 *
 * Board-supplied SPI2 chip-select and status callbacks.  Software NSS for
 * the W25Q256 only — toggle PB12 active-low when the SPI core asks to
 * select SPIDEV_FLASH(0).  Other devids are no-op (currently none).
 ****************************************************************************/

void stm32_spi2select(FAR struct spi_dev_s *dev, uint32_t devid,
                      bool selected)
{
  if (devid == SPIDEV_FLASH(0))
    {
      stm32_gpiowrite(GPIO_W25_CS, !selected);
    }
}

uint8_t stm32_spi2status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  return 0;
}

/****************************************************************************
 * Name: stm32_w25q256_initialize
 *
 * Bring up the W25Q256: configure /CS, initialize SPI2, probe the chip,
 * carve a partition that excludes the LEGO-reserved 1 MB at the start,
 * register /dev/mtdblock0, and try to mount LittleFS at /mnt/flash.
 *
 * Failure is non-fatal — bringup continues with /mnt/flash absent.  The
 * full-chip raw device is not registered to keep the LEGO bootloader area
 * out of reach of user space.
 ****************************************************************************/

int stm32_w25q256_initialize(void)
{
  FAR struct spi_dev_s *spi;
  FAR struct mtd_dev_s *mtd_full = NULL;
  FAR struct mtd_dev_s *mtd_part = NULL;
  bool registered = false;
  int ret;

  /* /CS = PB12, idle HIGH */

  stm32_configgpio(GPIO_W25_CS);

  spi = stm32_spibus_initialize(2);
  if (spi == NULL)
    {
      syslog(LOG_ERR, "W25Q256: stm32_spibus_initialize(2) failed\n");
      return -ENODEV;
    }

  mtd_full = w25q256_initialize(spi);
  if (mtd_full == NULL)
    {
      syslog(LOG_ERR, "W25Q256: chip not detected\n");
      /* w25q256_initialize() already freed its own allocation on failure */
      return -ENODEV;
    }

  /* Carve out the FS partition (skip the first 1 MB).  The partition
   * layer takes block units measured in the parent MTD's blocksize
   * (which we report as 256 B page).
   */

  mtd_part = mtd_partition(mtd_full,
                           (off_t)W25Q256_FS_START_SECTOR
                               * (W25Q256_SECTOR_SIZE / W25Q256_PAGE_SIZE),
                           (off_t)W25Q256_FS_NSECTORS
                               * (W25Q256_SECTOR_SIZE / W25Q256_PAGE_SIZE));
  if (mtd_part == NULL)
    {
      syslog(LOG_ERR, "W25Q256: mtd_partition failed\n");
      ret = -ENOMEM;
      goto errout_free_full;
    }

