owhinata/spike-nx/boards/spike-prime-hub/src/stm32_w25q256.c
  ret = register_mtddriver(W25Q256_MTDBLOCK_PATH, mtd_part, 0644, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "W25Q256: register_mtddriver(%s) failed: %d\n",
             W25Q256_MTDBLOCK_PATH, ret);
      goto errout_free_full;
    }

  registered = true;

#ifdef CONFIG_FS_LITTLEFS
  /* Try to mount.  NuttX's "autoformat" only triggers on -EFAULT (CORRUPT),
   * but a freshly erased chip with no superblock at all returns -EINVAL
   * (LFS_ERR_INVAL from lfs_rawmount when the directory scan completes
   * without finding any superblock — see littlefs/lfs.c:4259).  Treat both
   * as "absent or unrecognized FS" and format on first boot.  Any other
   * error (notably -EIO from SPI) propagates without touching the chip.
   */

  ret = nx_mount(W25Q256_MTDBLOCK_PATH, W25Q256_MOUNT_POINT,
                 W25Q256_FS_TYPE, 0, NULL);
  if (ret == -EFAULT || ret == -EINVAL)
    {
      syslog(LOG_INFO,
             "W25Q256: no LittleFS detected (mount=%d), formatting...\n",
             ret);
      ret = nx_mount(W25Q256_MTDBLOCK_PATH, W25Q256_MOUNT_POINT,
                     W25Q256_FS_TYPE, 0, "forceformat");
    }

  if (ret < 0)
    {
      syslog(LOG_ERR,
             "W25Q256: LittleFS mount %s failed: %d (use "
             "'mount -t littlefs -o autoformat %s %s' to recover)\n",
             W25Q256_MOUNT_POINT, ret,
             W25Q256_MTDBLOCK_PATH, W25Q256_MOUNT_POINT);
      goto errout_unregister;
    }

  syslog(LOG_INFO, "W25Q256: LittleFS mounted at %s\n",
         W25Q256_MOUNT_POINT);
#endif

  return OK;

errout_unregister:
  if (registered)
    {
      unregister_mtddriver(W25Q256_MTDBLOCK_PATH);
    }

errout_free_full:
  /* mtd_full is the first field of our struct w25q256_dev_s, so freeing
   * the mtd pointer also releases the driver state.  mtd_part (allocated
   * inside mtd_partition()) has no public free API in NuttX — accept that
   * one-shot bringup leaks the partition wrapper on these rare paths.
   */

  kmm_free(mtd_full);
  return ret;
}

#endif /* CONFIG_STM32_SPI2 */
